app/views/main/home.html.erb

SELECT COUNT(*) FROM "topics" WHERE (category_id = 1)
---
                <div class="row">
                  <div class="col m6">Chủ đề : <%= Topic.where("category_id = ?" , category.id).count %>