app/controllers/main_controller.rb

SELECT "categories".* FROM "categories"
SELECT "traders".* FROM "traders"
SELECT COUNT(*) FROM "topics" WHERE (category_id = 1)
---
  def home
    @categories = Category.all
    @topics = Topic.all
    @traders = Trader.all

    @count_topic_phone = Topic.count(:condition => "type_post = 'phone'" )