app/controllers/mobile_post_controller.rb

SELECT "mobiles".* FROM "mobiles"
SELECT "topics".* FROM "topics"
---
  def mobile
    @mobiles = Mobile.all
    @topics = Topic.all