app/controllers/mobiles_controller.rb

SELECT "mobiles".* FROM "mobiles"
---
  def index
    @mobiles = Mobile.all

INSERT INTO "mobiles" ("name", "description", "image_url", "type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "iPhone"], ["description", ""], ["image_url", ""], ["type", ""], ["created_at", "2016-03-07 15:13:42.973078"], ["updated_at", "2016-03-07 15:13:42.973078"]]
---
  def create
    @mobile = Mobile.new(mobile_params)

    respond_to do |format|
      if @mobile.save

UPDATE "mobiles" SET "image_url" = ?, "updated_at" = ? WHERE "mobiles"."id" = ?  [["image_url", "phone_iphone"], ["updated_at", "2016-03-08 06:39:19.965277"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @mobile.update(mobile_params)

DELETE FROM "mobiles" WHERE "mobiles"."id" = ?  [["id", 8]]
---
  def destroy
    @mobile.destroy

SELECT  "mobiles".* FROM "mobiles" WHERE "mobiles"."id" = ? LIMIT 1  [["id", 8]]
---
    def set_mobile
      @mobile = Mobile.find(params[:id])