app/controllers/topics_controller.rb

INSERT INTO "topics" ("type_post", "timestamp", "title", "content", "image_url", "last_timestamp", "last_user", "tag", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save

UPDATE "topics" SET "title" = ?, "last_timestamp" = ?, "last_user" = ?, "tag" = ?, "updated_at" = ? WHERE "topics"."id" = ?
---
  def update
    respond_to do |format|
      if @topic.update(topic_params)